In [2]:
import pandas as pd
df=pd.read_csv("whether_data3.csv")
df

         day  hydrabad  new york  chocago
0     monday        79        30       65
1    tuesday        69        32       63
2  wednesday        59        33       85
3   thursday        63        28       74
4     friday        85        26       65
5   saturday        48        32       59
6     sunday        64        19       74

In [ ]:
df1=pd.melt(df,id_vars=["day"])